{"format": "graph-model", "generatedBy": "2.6.4", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"conv2d_4_input": {"name": "conv2d_4_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"dense_5": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_8/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_9/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_10/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_11/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/global_max_pooling2d_1/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "conv2d_4_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Elu", "op": "_FusedConv2D", "input": ["conv2d_4_input", "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/conv2d_4/Elu", "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/Elu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3", "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/Elu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/conv2d_5/Elu", "StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/conv2d_6/Elu", "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/Elu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3", "StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_8/Elu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/conv2d_7/Elu", "StatefulPartitionedCall/sequential_1/conv2d_8/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/conv2d_8/Elu", "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_9/Elu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3", "StatefulPartitionedCall/sequential_1/conv2d_9/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "num_host_args": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_10/Elu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/conv2d_9/Elu", "StatefulPartitionedCall/sequential_1/conv2d_10/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "num_host_args": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/conv2d_10/Elu", "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Scaled"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3", "op": "Add", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Mul", "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_11/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3", "StatefulPartitionedCall/sequential_1/conv2d_11/Conv2D/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_host_args": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/global_max_pooling2d_1/Max", "op": "Max", "input": ["StatefulPartitionedCall/sequential_1/conv2d_11/BiasAdd", "StatefulPartitionedCall/sequential_1/global_max_pooling2d_1/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_11/Elu", "op": "Elu", "input": ["StatefulPartitionedCall/sequential_1/global_max_pooling2d_1/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/Elu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/conv2d_11/Elu", "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/Elu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_3/Elu", "StatefulPartitionedCall/sequential_1/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_4/Elu", "StatefulPartitionedCall/sequential_1/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_5/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_4/Conv2D/ReadVariableOp", "shape": [7, 7, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_4/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/Conv2D/ReadVariableOp", "shape": [7, 7, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_5/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/Conv2D/ReadVariableOp", "shape": [5, 5, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_6/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/Conv2D/ReadVariableOp", "shape": [5, 5, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_7/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_8/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_8/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_9/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_9/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_10/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_10/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_11/Conv2D/ReadVariableOp", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_11/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/global_max_pooling2d_1/Max/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/MatMul/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_3/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/MatMul/ReadVariableOp", "shape": [64, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/MatMul/ReadVariableOp", "shape": [32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_6/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/Scaled", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_5/FusedBatchNormV3/Offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/Scaled", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_4/FusedBatchNormV3/Offset", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Scaled", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/batch_normalization_7/FusedBatchNormV3/Offset", "shape": [64], "dtype": "float32"}]}]}